aim_website/app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations"
---
  def index
    @registrations = Registration.all

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @registration = Registration.find(params[:id])

INSERT INTO "registrations" ("company_name", "created_at", "email", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["company_name", "jh"], ["created_at", Mon, 31 Mar 2014 09:44:42 UTC +00:00], ["email", "hijh"], ["first_name", "jh"], ["last_name", "jh"], ["updated_at", Mon, 31 Mar 2014 09:44:42 UTC +00:00]]
---
  def create
    # p params
    # p "$$$$$$"
    # p params[:registration] #:first_name => "assdas",:last_name => "dasdas"
    register= {:first_name=>params[:first_name],:last_name=>params[:last_name],:email=>params[:email],:company_name=>params[:company_name]}
    # p register
    @registration = Registration.new(register)

  if @registration.save